import {renderMainWith} from "./mainRender.js";
import {parseHTML} from "./api.js";
import {navigateBack} from "./navigation.js";

const privacyPolicy = parseHTML(`
<div class="document-page">
    <h1>Политика конфиденциальности</h1>
    <a class="back-link">← Назад</a>
    
    <p>Администрация Сайта стремится защищать и уважать вашу частную жизнь. Настоящая политика конфиденциальности определяет, что Сайт получает ваши личные данные, в том числе контактные и персональные данные. Данные обрабатываются исключительно для исполнения вашего поручения. Мы просим вас внимательно прочитать нижеизложенное, чтобы в полной мере понять практику, касающуюся ваших данных.</p>
    <p>Сайт может собирать и обрабатывать данные о Пользователе, которую Пользователь предоставляет через сервисы и формы на Сайте. Использование данных осуществляется с вашего разрешения.</p>
    
    <h2>Безопасность</h2>
    <p>Защита ваших данных осуществляется с использованием физических, технических и административных мероприятий, нацеленных на предотвращение риска потери, неправильного использования, несанкционированного доступа, нарушения конфиденциальности и изменения данных.</p>
    <p>Меры обеспечения безопасности включают в себя межсетевую защиту и шифрование данных, контроль физического доступа к центрам обработки данных, а также контроль полномочий на доступ к данным.</p>
    <p>Хотя передача информации через Интернет никогда не является полностью безопасной, мы тем не менее делаем все возможное, чтобы защитить ваши личные данные.</p>
    
    <h2>Персональные данные</h2>
    <p>Сайт принимает все разумные меры по защите персональных данных Пользователей и соблюдает права субъектов персональных данных, установленные действующим законодательством Российской Федерации.</p>
    <p>Оформление заказа на Сайте и предоставление Пользователем своих персональных данных, в том числе через любые формы на сайте, администрации Сайта выражают согласие Пользователя на их обработку (понятие «обработка персональных данных» — согласно п.3 ст.3 ФЗ 152 «О персональных данных»).</p>
    <p>Обработка персональных данных осуществляется в целях исполнения Договора (Заказа Пользователя), исключительно на территории Российской Федерации, с соблюдением действующего законодательства РФ. Согласие дается на срок, определенный сроком исполнения Договора. В случае отзыва согласия на использование и обработку персональных данных Пользователя, Пользователь уведомляет об этом Администрацию Сайта письменно или по электронной почте. После получения данного уведомления Администрацией Сайта предоставление Пользователю услуг прекращается.</p>
    <p>Сайт не имеет статуса оператора персональных данных. Персональные данные Пользователя не передаются каким-либо третьим лицам, за исключением случаев, прямо предусмотренных настоящей Политикой конфиденциальности.</p>
    
    <h2>Изменения политики конфиденциальности</h2>
    <p>Любые изменения политики конфиденциальности в будущем будут размещены на этой странице. При необходимости вам будет выслано уведомление по электронной почте.</p>
</div>
`);

privacyPolicy.querySelector('.back-link').addEventListener("click", e => {
    e.preventDefault();
    navigateBack();
});

export function renderPrivacyPolicyPage() {
    renderMainWith(privacyPolicy);
}

const clientAgreement = parseHTML(`
<div class="document-page">
    <h1>Пользовательское соглашение</h1>
    <a class="back-link">← Назад</a>
    
    <p>Настоящее пользовательское соглашение (далее — «Соглашение») регулирует порядок работы сайта, определяет условия использования Пользователями контента, материалов и сервисов настоящего сайта (далее — «Сайт»). Настоящее Соглашение является публичной офертой в соответствии с законодательством России. Получая доступ к контенту, материалам, сервисам или предоставляя данные через формы на Сайте, Пользователь считается присоединившимся к настоящему Соглашению.</p>
    
    <h2>1. Условия использования сайта</h2>
    <p>1.1. Использование контента, любых материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации. Контент, материалы и сервисы можно использовать исключительно в законных целях.</p>
    <p>1.2. Пользователь вправе знакомиться с материалами и информацией сайта, заказывать и приобретать товары и/или услуги, предлагаемые на Сайте.</p>
    <p>1.3. При наличии технической возможности Пользователь может иметь доступ к платным сервисам и разделам Сайта.</p>
    <p>1.4. Администратор Сайта вправе в любое время в одностороннем порядке изменять контент, содержимое, любые материалы и данные сайта, а также изменять условия настоящего Соглашения и порядок предоставления доступа к сайту. Такие изменения вступают в силу с момента размещения новой версии Соглашения на сайте или обновления сайта. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование контента, материалов и сервисов Сайта.</p>
    <p>1.5. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации.</p>
    <p>1.6. Все данные, размещенные или размещаемые на настоящем Сайте, находятся на ресурсах на территории России.</p>
    
    <h2>2. Обязательства</h2>
    <p>2.1. Пользователь соглашается не предпринимать действий, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере авторского права, интеллектуальной собственности, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта.</p>
    <p>2.2. Использование материалов Сайта без согласия правообладателя не допускается. Для правомерного использования материалов Сайта необходимо согласие Администратора сайта или правообладателя материалов.</p>
    <p>2.3. При использовании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна.</p>
    <p>2.4. При наличии технической возможности Пользователь может оставлять комментарии и иные записи на Сайте. Пользователь соглашается, что комментарии или иные записи не нарушают законодательства России, не являются экстремистскими, не нарушают общепринятых норм морали и нравственности.</p>
    <p>2.5. Администратор Сайта не несет ответственности за посещение и использование Пользователем внешних ресурсов, ссылки на которые могут содержаться на Сайте.</p>
    <p>2.6. Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, товарами или услугами, доступными на Сайте или полученными через внешние сайты или ресурсы, либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.</p>
    <p>2.7. Пользователь принимает положение о том, что все материалы и сервисы Сайта или любая их часть могут сопровождаться рекламой. Пользователь согласен с тем, что Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с такой рекламой.</p>
    <p>2.8. Пользователь, используя ресурсы Сайта, подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и безусловно принимает их.</p>
    
    <h2>3. Безопасность</h2>
    <p>3.1. Защита ваших данных осуществляется с использованием физических, технических и административных мероприятий, нацеленных на предотвращение риска потери, неправильного использования, несанкционированного доступа, нарушения конфиденциальности и изменения данных.</p>
    <p>3.2. Меры обеспечения безопасности включают в себя межсетевую защиту и шифрование данных, контроль физического доступа к центрам обработки данных, а также контроль полномочий на доступ к данным.</p>
    <p>3.3. Хотя передача информации через Интернет никогда не является полностью безопасной, мы тем не менее делаем все возможное, чтобы защитить ваши личные данные.</p>
    
    <h2>4. Персональные данные</h2>
    <p>4.1. Сайт принимает все разумные меры по защите персональных данных Пользователей и соблюдает права субъектов персональных данных, установленные действующим законодательством Российской Федерации.</p>
    <p>4.2. Оформление заказа на Сайте и предоставление Пользователем своих персональных данных администрации Сайта, в том числе через любые формы на сайте, выражают согласие Пользователя на их обработку (понятие «обработка персональных данных» — согласно п.3 ст.3 ФЗ 152 «О персональных данных»).</p>
    <p>4.3. Обработка персональных данных осуществляется в целях исполнения Договора (Заказа Пользователя), исключительно на территории Российской Федерации, с соблюдением действующего законодательства РФ. Согласие дается на срок, определенный сроком исполнения Договора. В случае отзыва согласия на использование и обработку персональных данных Пользователя, Пользователь уведомляет об этом Администрацию Сайта письменно или по электронной почте. После получения Администрацией Сайта данного уведомления предоставление Пользователю услуг прекращается.</p>
    <p>4.4. Сайт не имеет статуса оператора персональных данных. Персональные данные Пользователя не передаются каким-либо третьим лицам, за исключением случаев, прямо предусмотренных настоящим соглашением.</p>
    
    <h2>5. Изменения соглашения</h2>
    <p>5.1. Любые изменения соглашения в будущем будут размещены на этой странице. При необходимости вам будет выслано уведомление по электронной почте.</p>
</div>
`);

clientAgreement.querySelector('.back-link').addEventListener("click", e => {
    e.preventDefault();
    navigateBack();
});

export function renderClientAgreementPage() {
    renderMainWith(clientAgreement);
}